In [2]:
import os
cwd = os.getcwd()
print(cwd)

C:\Users\user\Downloads\titanic-extended\titanic

In [3]:
import pandas as pd
import numpy as np

In [4]:
train_data= pd.read_csv('traint.csv')
test_data= pd.read_csv('testt.csv')
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
print(train_data.isnull().sum())
print(test_data.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64
PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [7]:
train_data.drop([ "Ticket" , "Cabin", "Name", ], axis = 1, inplace = True) 
test_data.drop([ "Ticket" , "Cabin"], axis = 1, inplace = True)

In [8]:
from sklearn.preprocessing import LabelEncoder
le1 = LabelEncoder()
train_data['Sex'] = le1.fit_transform(train_data['Sex'])
train_data.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    1  22.0      1      0   7.2500        S
1            2         1       1    0  38.0      1      0  71.2833        C
2            3         1       3    0  26.0      0      0   7.9250        S
3            4         1       1    0  35.0      1      0  53.1000        S
4            5         0       3    1  35.0      0      0   8.0500        S

In [9]:
from sklearn.preprocessing import LabelEncoder
le2 = LabelEncoder()
test_data['Sex'] = le2.fit_transform(test_data['Sex'])
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,892,3,"Kelly, Mr. James",1,34.5,0,0,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,9.6875,Q
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,12.2875,S

In [10]:
train_data["total_family"] = train_data["SibSp"] + train_data["Parch"] + 1

In [11]:
train_data["Single"] = train_data.total_family.apply(lambda x: 1 if x == 1 else 0)

In [12]:
train_data.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,total_family,Single
0,1,0,3,1,22.0,1,0,7.2500,S,2,0
1,2,1,1,0,38.0,1,0,71.2833,C,2,0
2,3,1,3,0,26.0,0,0,7.9250,S,1,1
3,4,1,1,0,35.0,1,0,53.1000,S,2,0
4,5,0,3,1,35.0,0,0,8.0500,S,1,1

In [13]:
test_data["total_family"] = test_data["SibSp"] + test_data["Parch"] + 1

In [14]:
test_data["Single"] = test_data.total_family.apply(lambda x: 1 if x == 1 else 0)

In [15]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,total_family,Single
0,892,3,"Kelly, Mr. James",1,34.5,0,0,7.8292,Q,1,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,7.0000,S,2,0
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,9.6875,Q,1,1
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,8.6625,S,1,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,12.2875,S,3,0

In [16]:
train_data.shape

(891, 11)

In [17]:
test_data.shape

(418, 11)

In [18]:
train_data["Embarked"].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [19]:
train_data["Embarked"].replace(np.nan, 'S', inplace=True)

In [20]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
le1= LabelEncoder()
train_data['Embarked']=le1.fit_transform(train_data['Embarked'])
train_data.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,total_family,Single
0,1,0,3,1,22.0,1,0,7.2500,2,2,0
1,2,1,1,0,38.0,1,0,71.2833,0,2,0
2,3,1,3,0,26.0,0,0,7.9250,2,1,1
3,4,1,1,0,35.0,1,0,53.1000,2,2,0
4,5,0,3,1,35.0,0,0,8.0500,2,1,1

In [21]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
le2= LabelEncoder()
test_data['Embarked']=le2.fit_transform(test_data['Embarked'])
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,total_family,Single
0,892,3,"Kelly, Mr. James",1,34.5,0,0,7.8292,1,1,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,7.0000,2,2,0
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,9.6875,1,1,1
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,8.6625,2,1,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,12.2875,2,3,0

In [22]:
train_data= train_data[[c for c in train_data if c not in ['Survived']] + ['Survived']]
train_data.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,total_family,Single,Survived
0,1,3,1,22.0,1,0,7.2500,2,2,0,0
1,2,1,0,38.0,1,0,71.2833,0,2,0,1
2,3,3,0,26.0,0,0,7.9250,2,1,1,1
3,4,1,0,35.0,1,0,53.1000,2,2,0,1
4,5,3,1,35.0,0,0,8.0500,2,1,1,0

In [23]:
avg=train_data["Age"].mean()
print(avg)

29.69911764705882

In [24]:
test_data["Age"].value_counts()

24.0    17
21.0    17
22.0    16
30.0    15
18.0    13
        ..
7.0      1
60.5     1
26.5     1
76.0     1
34.5     1
Name: Age, Length: 79, dtype: int64

In [25]:
train_data["Age"].replace(np.nan, avg, inplace=True)
print(train_data.isnull().sum())

PassengerId     0
Pclass          0
Sex             0
Age             0
SibSp           0
Parch           0
Fare            0
Embarked        0
total_family    0
Single          0
Survived        0
dtype: int64

In [26]:
test_data["Age"].replace(np.nan, 21, inplace=True)
print(test_data.isnull().sum())

PassengerId     0
Pclass          0
Name            0
Sex             0
Age             0
SibSp           0
Parch           0
Fare            1
Embarked        0
total_family    0
Single          0
dtype: int64

In [27]:
test_data["Fare"].replace(np.nan, 50.0 , inplace=True)

In [28]:
train_data.shape

(891, 11)

In [29]:
test_data.shape

(418, 11)

In [30]:
train_data.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,total_family,Single,Survived
0,1,3,1,22.0,1,0,7.2500,2,2,0,0
1,2,1,0,38.0,1,0,71.2833,0,2,0,1
2,3,3,0,26.0,0,0,7.9250,2,1,1,1
3,4,1,0,35.0,1,0,53.1000,2,2,0,1
4,5,3,1,35.0,0,0,8.0500,2,1,1,0

In [31]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,total_family,Single
0,892,3,"Kelly, Mr. James",1,34.5,0,0,7.8292,1,1,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,7.0000,2,2,0
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,9.6875,1,1,1
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,8.6625,2,1,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,12.2875,2,3,0

In [32]:
columns=["Pclass", "Sex", "Age" ,"total_family", "Single", "Fare", "Embarked"] 
x=train_data[columns]
y=train_data['Survived']

In [33]:
from sklearn.model_selection import train_test_split 
xtrain, xtest, ytrain, ytest = train_test_split( 
        x, y, test_size = 0.30, random_state = 0)

In [34]:
from sklearn.preprocessing import StandardScaler 
sc_x = StandardScaler() 
xtrain = sc_x.fit_transform(xtrain) 
xtest = sc_x.transform(xtest)

In [37]:
import sys
!{sys.executable} -m pip install xgboost

Collecting xgboost
  Downloading https://files.pythonhosted.org/packages/b1/11/cba4be5a737c6431323b89b5ade818b3bbe1df6e8261c6c70221a767c5d9/xgboost-1.0.2-py3-none-win_amd64.whl (24.6MB)
Requirement already satisfied: scipy in c:\users\user\anaconda3\lib\site-packages (from xgboost) (1.4.1)
Requirement already satisfied: numpy in c:\users\user\anaconda3\lib\site-packages (from xgboost) (1.16.5)
Installing collected packages: xgboost
Successfully installed xgboost-1.0.2

In [38]:
from xgboost import XGBClassifier
clf = XGBClassifier(learning_rate = 0.05,
 n_estimators=300,
 max_depth=5)
clf.fit(xtrain, ytrain)

XGBClassifier(base_score=0.5, booster=None, colsample_bylevel=1,
              colsample_bynode=1, colsample_bytree=1, gamma=0, gpu_id=-1,
              importance_type='gain', interaction_constraints=None,
              learning_rate=0.05, max_delta_step=0, max_depth=5,
              min_child_weight=1, missing=nan, monotone_constraints=None,
              n_estimators=300, n_jobs=0, num_parallel_tree=1,
              objective='binary:logistic', random_state=0, reg_alpha=0,
              reg_lambda=1, scale_pos_weight=1, subsample=1, tree_method=None,
              validate_parameters=False, verbosity=None)

In [40]:
y_pred = clf.predict(xtest)
predictions = [round(value) for value in y_pred]

In [41]:
from sklearn.metrics import accuracy_score
accuracy = accuracy_score(ytest, predictions)
print("Accuracy: %.2f%%" % (accuracy * 100.0))

Accuracy: 82.84%

In [42]:
from sklearn.ensemble import GradientBoostingClassifier
clf = GradientBoostingClassifier(random_state = 3 ,warm_start=True)
clf.fit(xtrain, ytrain)
y_pred=clf.predict(xtest)
print('Accuracy on training data=',clf.score(xtest,ytest)*100,'%')

Accuracy on training data= 84.32835820895522 %

In [450]:
from sklearn.model_selection import cross_val_score
clf = GradientBoostingClassifier(random_state = 3 ,warm_start=True)
scores = cross_val_score(clf, xtrain, ytrain, cv=10, scoring = "accuracy")
print("Scores:", scores)
print("Mean:", scores.mean())
print("Standard Deviation:", scores.std())

Scores: [0.8125     0.87301587 0.83870968 0.82258065 0.82258065 0.80645161
 0.80645161 0.83870968 0.80645161 0.82258065]
Mean: 0.8250032002048131
Standard Deviation: 0.019716420299159224

In [46]:
from sklearn.ensemble import GradientBoostingClassifier
clf = GradientBoostingClassifier(random_state = 0 ,warm_start=True)
clf.fit(x, y)

GradientBoostingClassifier(criterion='friedman_mse', init=None,
                           learning_rate=0.1, loss='deviance', max_depth=3,
                           max_features=None, max_leaf_nodes=None,
                           min_impurity_decrease=0.0, min_impurity_split=None,
                           min_samples_leaf=1, min_samples_split=2,
                           min_weight_fraction_leaf=0.0, n_estimators=100,
                           n_iter_no_change=None, presort='auto',
                           random_state=0, subsample=1.0, tol=0.0001,
                           validation_fraction=0.1, verbose=0, warm_start=True)

In [47]:
y_pred = clf.predict(test_data[columns])

In [48]:
submission = pd.DataFrame({
        "PassengerId": test_data["PassengerId"],
        "Survived": y_pred
    })

submission.to_csv("somya.csv", index=False)
print(submission.shape)

(418, 2)